app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products"  ORDER BY created_at DESC

  def create
    @product = Product.new(products_params)
    if @product.save
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "dinesh"], ["price", 200], ["created_at", "2016-09-21 06:07:01.981781"], ["updated_at", "2016-09-21 06:07:01.981781"]]

  def searchable
    searchword = params[:search]
    @data = Product.where(name: searchword)
---
SELECT "products".* FROM "products" WHERE "products"."name" = ?  [["name", "data"]]